src/cf/InformationRegisters/МП_СведенияОПользователях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_СведенияОПользователях</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПервоначальнойЗагрузкиДанных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтметкаВремениСборкиДанных</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПользовательМобильногоПриложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиМобильногоПриложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/МП_СведенияОПользователях/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Записывает сведения о мобильном клиенте.
// Параметры:
//	МобильныйКлиент - ссылка на узел плана обмена Мобильный
//	Дата - дата и время последнего подключения
//	Сведения - строка с описанием мобильного клиента
//
Процедура ЗаписатьСведенияОКлиенте(ПользовательМП, Дата, Описание, Версия) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.МП_СведенияОПользователях.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПользовательМобильногоПриложения = ПользовательМП;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.ПользовательМобильногоПриложения = ПользовательМП;
	МенеджерЗаписи.ДатаПоследнейАктивности = Дата;
	Если Не ЗначениеЗаполнено(МенеджерЗаписи.Описание) Или ЗначениеЗаполнено(Описание) Тогда
		МенеджерЗаписи.Описание = Описание;
	КонецЕсли;
	МенеджерЗаписи.Версия = Версия;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
	
// Возвращает дату последнего подключения мобильного клиента
// Параметры:
//	МобильныйКлиент - ссылка на узел плана обмена Мобильный
Функция ПолучитьДатуПоследнейАктивностиКлиента(ПользовательМП) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МП_СведенияОПользователях.ДатаПоследнейАктивности
		|ИЗ
		|	РегистрСведений.МП_СведенияОПользователях КАК МП_СведенияОПользователях
		|ГДЕ
		|	МП_СведенияОПользователях.МобильныйКлиент = &ПользовательМП";
	Запрос.УстановитьПараметр("ПользовательМП", ПользовательМП);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаПоследнейАктивности;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСведения(ПользовательМП) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МП_СведенияОПользователях.ДатаПоследнейАктивности КАК ДатаПоследнейАктивности,
		|	МП_СведенияОПользователях.Описание КАК Описание,
		|	МП_СведенияОПользователях.Версия КАК Версия,
		|	МП_СведенияОПользователях.ОтметкаВремениСборкиДанных КАК ОтметкаВремениСборкиДанных,
		|	МП_СведенияОПользователях.ДатаПервоначальнойЗагрузкиДанных КАК ДатаПервоначальнойЗагрузкиДанных
		|ИЗ
		|	РегистрСведений.МП_СведенияОПользователях КАК МП_СведенияОПользователях
		|ГДЕ
		|	МП_СведенияОПользователях.ПользовательМобильногоПриложения = &ПользовательМП";
	Запрос.УстановитьПараметр("ПользовательМП", ПользовательМП);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьВерсию(МобильноеПриложение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи = РегистрыСведений.МП_СведенияОПользователях.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПользовательМобильногоПриложения = МобильноеПриложение;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат МенеджерЗаписи.Версия;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьДатуПервоначальнойЗагрузкиДанных(МобильноеПриложение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Сведения = ПолучитьСведения(МобильноеПриложение);
	
	Если Сведения <> Неопределено Тогда
		Возврат Сведения.ДатаПервоначальнойЗагрузкиДанных;
	КонецЕсли; 
	
КонецФункции

Процедура ЗаписатьДатуПервоначальнойЗагрузкиДанных(МобильноеПриложение, Дата) Экспорт
	
	МЗ = СоздатьМенеджерЗаписи();
	МЗ.ПользовательМобильногоПриложения = МобильноеПриложение;
	МЗ.Прочитать();
	МЗ.ДатаПервоначальнойЗагрузкиДанных = Дата;
	МЗ.Записать();
	
КонецПроцедуры

Процедура ЗаписатьОтметкуСборкиДанных(МобильноеПриложение, Отметка) Экспорт
	
	МЗ = РегистрыСведений.МП_СведенияОПользователях.СоздатьМенеджерЗаписи();
	МЗ.ПользовательМобильногоПриложения = МобильноеПриложение;
	МЗ.Прочитать();
	МЗ.ОтметкаВремениСборкиДанных = Отметка;
	МЗ.Записать();
	
КонецПроцедуры

Функция ПолучитьОтметкуВремени(МобильноеПриложение) Экспорт
	
	Сведения = ПолучитьСведения(МобильноеПриложение);
	
	Если Сведения <> Неопределено Тогда
		Возврат Сведения.ОтметкаВремениСборкиДанных;	
	КонецЕсли; 
	
КонецФункции

#КонецЕсли
